[M_ClapTrapStash MissionDefinition]
MissionDescription="Claptrap is ready to take you to the potty box [place]i am sad[-place], But only if you want to do it through a few (hundreds) of hoops."
TurnInDescription="An invincible Claptrap will let you into his secret room faster than you think "
